#  Importing Libraries

In [2]:
import pandas as pd 
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import warnings
warnings.filterwarnings('ignore')
import plotly.express as px

# Housing dataset few questions

df=pd.read_csv(r'C:\Users\lenovo\Downloads\housing.csv')

In [4]:
df.head()

,id,date,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors,waterfront,view,...,grade,sqft_above,sqft_basement,yr_built,yr_renovated,zipcode,lat,long,sqft_living15,sqft_lot15
0,7129300520,20141013T000000,221900,3,1.00,1180,5650,1.0,0,0,...,7,1180,0,1955,0,98178,47.5112,-122.257,1340,5650
1,6414100192,20141209T000000,538000,3,2.25,2570,7242,2.0,0,0,...,7,2170,400,1951,1991,98125,47.7210,-122.319,1690,7639
2,5631500400,20150225T000000,180000,2,1.00,770,10000,1.0,0,0,...,6,770,0,1933,0,98028,47.7379,-122.233,2720,8062
3,2487200875,20141209T000000,604000,4,3.00,1960,5000,1.0,0,0,...,7,1050,910,1965,0,98136,47.5208,-122.393,1360,5000
4,1954400510,20150218T000000,510000,3,2.00,1680,8080,1.0,0,0,...,8,1680,0,1987,0,98074,47.6168,-122.045,1800,7503

In [5]:
df.isnull().sum()

id               0
date             0
price            0
bedrooms         0
bathrooms        0
sqft_living      0
sqft_lot         0
floors           0
waterfront       0
view             0
condition        0
grade            0
sqft_above       0
sqft_basement    0
yr_built         0
yr_renovated     0
zipcode          0
lat              0
long             0
sqft_living15    0
sqft_lot15       0
dtype: int64

In [6]:
df.duplicated().sum()

np.int64(0)

In [7]:
df.columns

Index(['id', 'date', 'price', 'bedrooms', 'bathrooms', 'sqft_living',
       'sqft_lot', 'floors', 'waterfront', 'view', 'condition', 'grade',
       'sqft_above', 'sqft_basement', 'yr_built', 'yr_renovated', 'zipcode',
       'lat', 'long', 'sqft_living15', 'sqft_lot15'],
      dtype='object')

In [12]:
df[(df['waterfront']==1 )].shape[0]

163

In [13]:
df[(df['floors']==2)].shape[0]

8241

In [14]:
df[(df['yr_built']<1960) & (df['waterfront']==1)].shape[0]

80

In [16]:
df[(df['price']) & (df['bathrooms']>4)].max()

id                    7853440050
date             20150505T000000
price                    1042031
bedrooms                       9
bathrooms                    5.0
sqft_living                 4110
sqft_lot                   43560
floors                       2.5
waterfront                     0
view                           0
condition                      4
grade                         11
sqft_above                  4110
sqft_basement               1380
yr_built                    2015
yr_renovated                   0
zipcode                    98118
lat                      47.6927
long                    -121.886
sqft_living15               3690
sqft_lot15                 43995
dtype: object

In [17]:
df = pd.read_csv(r'C:\Users\lenovo\Downloads\housing.csv')

most_expensive = df[df['bathrooms'] > 4]['price'].max()

print("Most expensive house (bathrooms > 4):", most_expensive)

Most expensive house (bathrooms > 4): 7700000

# Toyota dataset few Questions

In [19]:
df = pd.read_csv(r"C:\Users\lenovo\Downloads\Downloads\ToyotaCorolla.csv")

In [20]:
df

,Unnamed: 0,Price,Age,KM,FuelType,HP,MetColor,Automatic,CC,Doors,Weight
0,0,13500,23.0,46986,Diesel,90,1.0,0,2000,3,1165
1,1,13750,23.0,72937,Diesel,90,1.0,0,2000,3,1165
2,2,13950,24.0,41711,Diesel,90,NaN,0,2000,3,1165
3,3,14950,26.0,48000,Diesel,90,0.0,0,2000,3,1165
4,4,13750,30.0,38500,Diesel,90,0.0,0,2000,3,1170
...,...,...,...,...,...,...,...,...,...,...,...
1431,1431,7500,NaN,20544,Petrol,86,1.0,0,1300,3,1025
1432,1432,10845,72.0,19000,Petrol,86,0.0,0,1300,3,1015
1433,1433,8500,NaN,17016,Petrol,86,0.0,0,1300,3,1015
1434,1434,7250,70.0,16916,NaN,86,1.0,0,1300,3,1015
1435,1435,6950,76.0,1,Petrol,110,0.0,0,1600,5,1114

In [24]:
#Use the ToyotaCorollaX.csv of size : 1436 x 11 for the questions mentioned below Choose the correct CC value having the second lowest price?

Object `price` not found.

In [26]:
df['FuelType'].fillna(df['FuelType'].mode()[0], inplace=True)

# Verify
print(df['FuelType'].isnull().sum())  # Should be 0

0

In [22]:


# Sort the dataframe by Price
df_sorted = df.sort_values(by='Price')

# Get the second lowest price row
second_lowest = df_sorted.iloc[1]  # iloc[0] is lowest, iloc[1] is second lowest

# Display CC value and corresponding Price
print(f"Second lowest price: {second_lowest['Price']}")
print(f"CC value at second lowest price: {second_lowest['CC']}")

Second lowest price: 4400
CC value at second lowest price: 2000

In [23]:
mean_price_by_doors = df.groupby('Doors')['Price'].mean().reset_index()

# Sort by mean price descending
mean_price_sorted = mean_price_by_doors.sort_values(by='Price', ascending=False)

# Get the second highest mean price
second_highest = mean_price_sorted.iloc[1]  # iloc[0] is highest, iloc[1] is second highest

print(f"Doors type with second highest mean price: {second_highest['Doors']}")
print(f"Mean price: {second_highest['Price']}")

Doors type with second highest mean price: 3.0
Mean price: 10107.342443729904